app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
						</thead>
						<% @user.books.each do |book| %>