app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
  def show
    @book = Book.find(params[:id])
    @books = Book.all

INSERT INTO "books" ("title", "opinion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["opinion", "1"], ["created_at", "2019-03-23 08:06:32.867419"], ["updated_at", "2019-03-23 08:06:32.867419"]]
---
  def create
  	book = Book.new(book_params)
    book.user_id = current_user.id
  	if book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "f"], ["opinion", "5"], ["updated_at", "2019-03-23 09:09:17.666003"], ["id", 12]]
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)