app/controllers/users_controller.rb

  def index
    @book = Book.new
  	@users = User.all
---
SELECT  "users".* FROM "users" WHERE (5) LIMIT ?  [["LIMIT", 1]]

  def show
  	@user = User.find_by(id: params[:id])
    @book = Book.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
  	@user = User.find(params[:id])
  	@user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "intro" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "dd3a3bba88bd283d9dbbbd05765958180021399ba0abe462bb2c736cf08c"], ["intro", "c"], ["updated_at", "2019-03-26 05:21:58.334535"], ["id", 8]]