app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE (5) LIMIT ?  [["LIMIT", 1]]